In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../titanic(ML course).csv', index_col='PassengerId')

In [3]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

1) Какое количество мужчин и женщин ехало на корабле? В качестве ответа приведите два числа через пробел

In [4]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

2) Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

In [5]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [6]:
round(df['Survived'].mean(), 2)

0.38

3) Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

In [7]:
pclass = df['Pclass'].value_counts()
result = pclass[1] * 100 / (pclass[1] + pclass[2] + pclass[3])
result

24.242424242424242

4) Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. Посчитайте среднее и медиану возраста пассажиров. В качестве ответа приведите два числа через пробел.

In [8]:
print(round(df['Age'].mean(), 5))
print(round(df['Age'].median(), 5))

29.69912
28.0

5) Коррелируют ли число братьев/сестер с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [9]:
corr = df['SibSp'].corr(df['Parch'], method='pearson')
corr * 100

41.48376986201567

6) Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и шумные, но из них требуется извлечь необходимую информацию. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

In [10]:
names = df[df['Sex'] == 'female']['Name'].apply(lambda full_name:
                                                full_name.split(',')[1].split()[1])
names.value_counts().head(5)

William    13
Mary        9
Anna        9
Thomas      6
John        6
Name: Name, dtype: int64